def func():
    a = ("1.Новый год",
         "2.Международный женкий день",
         "3.Наурыз",
         "4.Праздник единства народа Казахстана",
         "5.День защитника Отечества",
         "6.День Победы",
         "7.День Столицы",
         "8.День конституции РК",
         "9.День Независомости")
    b = ("1.Руководство",
         "2.Администрация",
         "3.Бухгалтерия",
         "4.Отдел продаж",
         "5.Программисты")
    c = [2, 2, 3, 1, 1, 1, 1, 1, 2, 1, 3]
    for i in range(0, 8+1):
            print(a[i])
    t = input("Выберите праздник: ")
    for i in range(0, 4+1):
            print(b[i])
    p = int(input("Выберите отдел: "))
    if c[p-1] >=3:
        if p==1:
            print(c[p-1]-2)
        if p==2:
            print(c[p-1]-1)
        if p==3:
            print(c[p-1])
        if p==4:
            print(c[p-1]+1)
        if p==5:
            print(c[p-1]+1)
func()




